[Killed] BlockStatement
Desktop/mutação/src/concurso.js:1:34
-function concurso(idade, altura) {
-  const alerta = "Você não tem os requisitos para fazer a inscrição";
-  const sucesso = "Você tem os requisitos para fazer a inscrição";
-
-  if (idade >= 18 && altura >= 1.65) {
-    return sucesso; // branch 2 passou pois sua idade e sua altura são, respectivamente, 18 anos e 1,65 m
-  } else {
-    return alerta; // branch 1 passou pois sua idade e sua altura são, respectivamente, 18 anos e 1,60 m
-  }
-}
+function concurso(idade, altura) {}
 
 module.exports = concurso;
killedBy: Deve testar os requisitos para inscrição no concurso Candidato não tem idade e tem altura
statusReason: Error: expect(received).toMatch(expected)

Matcher error: received value must be a string

Received has value: undefined

[Killed] EqualityOperator
Desktop/mutação/src/concurso.js:5:7
   const alerta = "Você não tem os requisitos para fazer a inscrição";
   const sucesso = "Você tem os requisitos para fazer a inscrição";
 
-  if (idade >= 18 && altura >= 1.65) {
+  if (idade < 18 && altura >= 1.65) {
     return sucesso; // branch 2 passou pois sua idade e sua altura são, respectivamente, 18 anos e 1,65 m
   } else {
killedBy: Deve testar os requisitos para inscrição no concurso Candidato não tem idade e tem altura
statusReason: Error: expect(received).toMatch(expected)

Expected pattern: /Você não tem os requisitos para fazer a inscrição/
Received string:  "Você tem os requisitos para fazer a inscrição"

[Killed] ConditionalExpression
Desktop/mutação/src/concurso.js:5:7
   const alerta = "Você não tem os requisitos para fazer a inscrição";
   const sucesso = "Você tem os requisitos para fazer a inscrição";
 
-  if (idade >= 18 && altura >= 1.65) {
+  if (true) {
     return sucesso; // branch 2 passou pois sua idade e sua altura são, respectivamente, 18 anos e 1,65 m
   } else {
killedBy: Deve testar os requisitos para inscrição no concurso Candidato não tem idade e tem altura
statusReason: Error: expect(received).toMatch(expected)

Expected pattern: /Você não tem os requisitos para fazer a inscrição/
Received string:  "Você tem os requisitos para fazer a inscrição"

[Killed] BlockStatement
Desktop/mutação/src/concurso.js:7:10
 
   if (idade >= 18 && altura >= 1.65) {
     return sucesso; // branch 2 passou pois sua idade e sua altura são, respectivamente, 18 anos e 1,65 m
-  } else {
-    return alerta; // branch 1 passou pois sua idade e sua altura são, respectivamente, 18 anos e 1,60 m
-  }
+  } else {}
 }
 
killedBy: Deve testar os requisitos para inscrição no concurso Candidato não tem idade e tem altura
statusReason: Error: expect(received).toMatch(expected)

Matcher error: received value must be a string

Received has value: undefined
